### how to download mysql:
<a>https://www.youtube.com/watch?v=yOmxJbZjTnU</a>

In [ ]:
# !pip install mysql-connector

In [1]:
import mysql.connector

In [2]:
# first, we connect to mysql through mysql.connector

db = mysql.connector.connect(host="localhost",
                             user="root",
                             passwd="BatonRouge1299-")

In [3]:
c = db.cursor()

In [4]:
# creating a database

c.execute('CREATE DATABASE testdatabase')

In [5]:
# how to show the current databases in mysql

c.execute('SHOW DATABASES')

In [6]:
c.fetchall()

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sql_hr',),
 ('sql_inventory',),
 ('sql_invoicing',),
 ('sql_store',),
 ('sys',),
 ('testdatabase',)]

In [7]:
c.execute("USE testdatabase")

In [8]:
# creating a table in the database

c.execute("""
    CREATE TABLE deneme
    (first_name VARCHAR(50),
     last_name VARCHAR(50),
     email VARCHAR(50),
     age INTEGER,
     user_id INTEGER AUTO_INCREMENT PRIMARY KEY);
""")

In [9]:
c.execute("""
    INSERT INTO deneme
    VALUES ('dustin', 'yates', 'dustinyates@gmail.com', 30, DEFAULT)
""")

In [10]:
c.execute("SELECT * FROM deneme")

In [11]:
c.fetchall()

[('dustin', 'yates', 'dustinyates@gmail.com', 30, 1)]

In [12]:
# connecting to another database in mysql

c.execute("USE sql_store")

In [13]:
c.execute("SHOW TABLES")

In [14]:
c.fetchall()

[('customers',),
 ('order_item_notes',),
 ('order_items',),
 ('order_statuses',),
 ('orders',),
 ('products',),
 ('shippers',)]

In [15]:
c.execute("SELECT * FROM customers")

In [16]:
# assigning the values in the customers table to the data variable

data = c.fetchall()

In [20]:
# to examine the column names of the customers table and their details 

c.execute("SHOW COLUMNS FROM customers")

In [21]:
c.fetchall()

[('customer_id', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('first_name', b'varchar(50)', 'NO', '', None, ''),
 ('last_name', b'varchar(50)', 'NO', '', None, ''),
 ('birth_date', b'date', 'YES', '', None, ''),
 ('phone', b'varchar(50)', 'YES', '', None, ''),
 ('address', b'varchar(50)', 'NO', '', None, ''),
 ('city', b'varchar(50)', 'NO', '', None, ''),
 ('state', b'char(2)', 'NO', '', None, ''),
 ('points', b'int', 'NO', '', b'0', '')]

In [22]:
# to get only the column names of the customers table

c.execute("""
    SELECT column_name
    FROM information_schema.columns
    WHERE table_name='customers';
""")

In [23]:
column_names = c.fetchall()

In [24]:
column_names

[('customer_id',),
 ('first_name',),
 ('last_name',),
 ('birth_date',),
 ('phone',),
 ('address',),
 ('city',),
 ('state',),
 ('points',)]

In [25]:
column_names = [i[0] for i in column_names]

In [26]:
# converting the information in the customers table to a pandas dataframe

pd.DataFrame(data, columns=column_names)

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
1,2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
2,3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
3,4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
4,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
5,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
6,7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
7,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
8,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
9,10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796